app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "reviews"
---
  def index
    @users = User.order(:id)
    @product_count = Product.count
    @review_count = Review.count