app/controllers/products_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "category_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Yoink"], ["description", "Hello? are you there?"], ["price", 100.0], ["created_at", 2017-04-04 22:53:27 UTC], ["updated_at", 2017-04-04 22:53:27 UTC], ["category_id", 1], ["user_id", 2]]
---
  def create
    @product = Product.new product_params
    @product.user = current_user

    if @product.save

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT $1  [["LIMIT", 20]]
---
  def index
    @products = Product.last(20)

UPDATE "products" SET "price" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["price", 12.04], ["description", "Schlitzel 4 giraffe moon pork belly migas biodiesel tofu next level."], ["updated_at", 2017-03-30 22:40:09 UTC], ["id", 906]]
---
  def update
    if !(can? :edit, @product)
      redirect_to root_path, alert: 'Access denied'
    elsif @product.update(product_params.merge({ slug: nil }))

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 908]]
---
  def destroy
    if can? :destroy, @product
      @product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 908], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find params[:id]