app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 902], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "body", "created_at", "updated_at", "product_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 4], ["body", "blah\r\n"], ["created_at", 2017-04-04 23:25:07 UTC], ["updated_at", 2017-04-04 23:25:07 UTC], ["product_id", 1], ["user_id", 2]]
---
  def create
  @product = Product.find params[:product_id]
  review_params = params.require(:review).permit(:body, :rating)
  @review = Review.new review_params
  @review.product = @product
  @review.user = current_user

  respond_to do |format|
    if @review.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 902], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
    def destroy
    @product = Product.find params[:product_id]
    @review = Review.find params[:id]
    @review.destroy