app/views/products/index.html.erb

<h3><%= link_to product.title, product_path(product) %></h3>
<p><%= product.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]