app/views/products/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<p><%= @product.price %></p>
<p><%= @product.user.first_name %></p>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 902]]
---
      <h1>Reviews</h1>
      <% @product.reviews.each do |r| %>